"""
Домашнее задание 1

Напишите функцию, имеющую 3 параметра: первые 2 - числа, третий - операция, которая должна быть произведена над ними. Если третий параметр «+», то нужно сложить числа, если «-» — вычесть, «*» — умножить, «/» — разделить (первое на второе). Функция возвращает результат выполнения операции над числами. Если операция не совпадает с указанными выше, то выводится сообщение "Неизвестная операция", и возвращается значение None.
"""


def calculation(x, y, operation):
    x = int(x)
    y = int(y)
    if operation == '+':
        return x + y
    elif operation == '-':
        return x - y
    elif operation == '*':
        return x * y
    elif operation == '/':
        return x / y

    print('Неизвестная операция')
    return None


print(calculation(input("Введите 1-е число: "),
      input("Введите 2-е число: "), input("Введите операцию (+, -, *, /): ")))
