"""
Домашнее задание 12

Даны файлы students.csv, results.csv, groups.csv, subjects.csv, teachers.csv. Разделены ";"
Файл groups.csv имеет столбцы id, text_name, entry_year, где id - уникальный идентификатор группы, text_name - наименование группы, entry_year - год поступления.
students.csv имеет следующие столбцы: id, first_name, last_name, group_id, где id - уникальный идентификатор студента (номер зачетной книжки), first_name - Имя, last_name - фамилия, group_id - идентификатор группы, в которой он учится.
result.csv имеет следующие столбцы: id - уникальный идентификатор записи, subject_id - идентификатор учебного предмета, student_id - уникальный идентификатор студента, att1 - результат первой аттестации, att2 - результат второй аттестации, exam - результат экзаменнационной или зачетной работы, total - общий результат, teacher_id - уникальный идентификатор преподавателя.
subjects.csv имеет следующие столбцы: id - уникальный идентификатор предмета, subject_name - наименование предмета.
teachers.csv: id - уникальный идентификатор преподавателя, first_name - Имя, last_name - фамилия, middle_name – отчество

Надо написать функцию, которая принимает id преподавателя и id группы. Функция возвращает False, если данный преподаватель не преподавал у данной группы, None, если такого прподавателя не существует, иначе возвращается словарь, в котором ключами являются наименования предметов, а значениями словари, которые хранят в себе информации о количестве студентов, сдавших на 5, 4, 3 и 2 по данному предмету.
"""
