"""
Домашнее задание 18

Из модулей math и numpy извлечь функции переводящие градусы в радианы. Соответственно извлеченным функциям перевести градусы в радианы двумя способами:

- перевести 75 градусов в радианы;
- перевести 180 градусов в радианы;
- перевести 90 градусов в радианы.

Сравнить полученные два значения, переведенные из градусов в радианы между собой. Вывести результат в виде полученных значений в радианах и утверждение о равенстве или неравенстве полученных значений при переводе градусов в радианы разными способами.
"""

from math import radians as math_rad
from numpy import radians as num_rad

print(
    f"Перевод 75° в радианы:\nMath - {math_rad(75)}\nNumpy - {num_rad(75)}\n")
print(
    f"Перевод 180° в радианы:\nMath - {math_rad(180)}\nNumpy - {num_rad(180)}\n")
print(
    f"Перевод 90° в радианы:\nMath - {math_rad(90)}\nNumpy - {num_rad(90)}\n")
