"""
Домашнее задание 2

Напишите функцию, которая находит наибольший общий делитель двух чисел, используя модифицированный алгоритм Евклида: нужно заменять большее число на остаток от деления большего на меньшее до тех пор, пока этот остаток не станет равен нулю; тогда второе и есть НОД. Функция должна возвращать найденное значение.
"""


def gcf(x, y):
    while x > 0 and y > 0:
        if x > y:
            x, y = x % y, y
        else:
            x, y = x, y % x
    return max(x, y)


print(gcf(int(input()), int(input())))
