"""
Задача (20 баллов)
Написать функцию, которая находит среднее арифметическое из списка целых чисел без учета повторяющихся элементов. То есть, если в списке одно и то же число повторяется несколько раз, то при вычислении арифметического среднего оно должно только один раз учитываться. Составить пример вызова функции.
"""


def uniq_average(array: list[int]):
    array = set(array)
    return sum(array)/len(array), array


print(uniq_average([1, 1, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]))
