"""
Задача (20 баллов)
Написать функцию, которая находит количество символов "a", содержащихся в строке, являющейся параметром функции. Составить пример вызова функции.
"""


def letter_count(line: str):
    return line.count('a')


print(letter_count("aaasssaa"))
